<template>
  <div class="container-detail">
    <div class="title">
      그로스쿨
      <div class="sub-title">
        하고 싶은 일을 원하는 곳에서
      </div>
    </div>
    <div class="bar"></div>
    <div class="body">
      <h2>
        소개
      </h2>
      <p>
        IT업계에서 일하는 비 개발자 직군들을 위한 커리어가이드 온라인 강의 서비스다.
      </p>
      <p>
        개발자를 위한 온라인 강의 서비스들은 다양하게 존재하고 새롭게 계속 생겨나고 있으나, 
        함께 프로덕트를 만드는 기획자, 디자이너, 마케터들을 위한 교육과정을 제공하는 서비스는 많이 없었다.
      </p>
      <p>                  
        IT업계의 변화가 빠르고 각 직군에서 사용하는 툴과 기술들도 변화의 속도가 굉장히 빨라, 
        그런 경향을 빠르게 캐치해서 교육 컨텐츠로 제공해주는 서비스는 더욱 부족한 상황이었다.
      </p>
      <p>
        그로스쿨은 그런 사용자들을 대상으로 온라인 강의, 오프라인 강의, 
        혼합형 패키지 강의들을 제공함으로써 실무에 빠르게 적응할 수 있도록 돕고자 하였다.
      </p>
      <p>
        프론트엔드를 중심으로 디자인과 기획, 그리고 서버/인프라도 인수인계받아 
        관리하면서 서비스 전체를 관리하는 경험을 해볼 수 있었다.
      </p>
      
      <h2>Dev</h2>
      <p>
        처음부터 마지막까지 혼자 개발해본 첫 상용 프로젝트다. 
        게다가 서버는 외주로 개발한 상태여서, 런칭 이후엔 서버도 인수인계받아 
        어느정도의 유지보수를 직접 해야만 했다. 
        다행히 서버는 Express로 되어 있어 새로운 언어를 익힐 필요는 없었지만, 
        DynamoDB를 처음 써보는 터라 꽤 고생을 했다.
      </p>
      <h3>메인페이지 컨텐츠 관리</h3>
      <p>
        그로스쿨은 프로덕트 중심의 서비스라기보단 상품 중심의 서비스로 제공될 가능성이 높다고 판단했다. 
        그에 따라 개발자가 없어도 메인페이지의 구성을 변경 할 때 관리자 사이트에서 설정만으로 
        다양한 종류의 컨텐츠 구성을 변경할 수 있도록 하는 시스템을 만들기 위해 노력했다. 
      </p>
      <h3>콘텐츠 에디터</h3>
      <p>
        인터뷰 컨텐츠나 강의 상세페이지 작성 시 사용하는 에디터의 자유도가 지나치게 높으면 
        사이트의 디자인 통일성이 떨어질 수 있기에, 
        인라인 스타일링을 제거하고 class기반의 css가 적용되도록 세팅하였다. 
        또한 컨텐츠를 작성하면서 미리보기를 통해 데스크탑과 모바일버전을 실시간으로 확인할 수 있도록 구성하여,
        컨텐츠 작성을 용이하게 하였다.
      </p>
      <ul>
        <li>그로스쿨 사용자 웹 클라이언트 개발</li>
        <li>그로스쿨 CMS 클라이언트 개발</li>
        <li>그로스쿨 서버 유지보수</li>
        <li>그로스쿨 웹 기획 및 디자인</li>
      </ul>
      <p class="stack">
        Next.js, React.js, MobX, Node.js, express, AWS Elastic Beanstalk, AWS Dynamo DB, AWS EC2, Github, Figma
      </p>
      <br/>
      <p>
        <a href="https://groschool.kr/" target="_blank">그로스쿨 Web</a>
      </p>
    </div>
  </div>
</template>

<script>
export default {
};

</script>

<style lang='scss' scoped>

</style>