<template>
  <div class="container-detail">
    <div class="title">
      모두의셔틀
      <div class="sub-title">
        출근셔틀 예약서비스
      </div>
    </div>
    <div class="bar"></div>
    <div class="body">
      <h3>
        UX/UI Design
      </h3>
      <p>
        출근셔틀 예약서비스 모두의셔틀은 기존에 회사단위로 운영되던 셔틀을 지역단위로 인원을 모집함으로써 더 많은 회사의, 더 많은 사람들이 출근셔틀을 이용할 수 있도록 도와주는 서비스다. 현재 모두의셔틀은 웹 기반 서비스이며, 모바일 어플리케이션은 기획까지는 완료하였으나, 아직 출시되지는 않았다.
      </p>
      <p>
        2016년 5월 Co-Founder로 참여했으며, 디자인과 서비스 기획을 총괄했다.
      </p>
      <p>
        완전 초기 스타트업이다 보니 디자인 총괄이라고는 하지만 디자인 외적인 운영과 CS업무 및 퍼블리싱까지 도맡아 하게되어, 아무래도 디자인 퀄리티나 완성도에 있어서 남는 아쉬움이 남는 서비스다.
      </p>
      <p>
        하지만 그만큼 다방면으로 익스트림한(...) 경험을 할 수 있었고, 특히 개발자와 1:1로 협업하면서 개발에 대한 이해력을 높인 게 큰 수확이 이었다. 버전관리 툴(Git/SourceTree)도 쓰고, Angular로 MVC모델도 익히고, CSS삽질도 하면서 많은 노하우를 쌓을 수 있는 기획였다.
      </p>
      <p>
        하지만 무엇보다 사회인으로써 '자금난'이 무엇인지 제대로 느낄 수 있었다. 학생 때 가끔 부족했었던 생활비와는 다가오는 느낌과 부담감이 그 궤를 달리했고, 그에 따르는 스트레스 때문인지 건강악화로 이어져 2017년 1월 다른 멤버들을 남겨둔 채 떠나게 되었다.
      </p>
      <img src="~/assets/images/modoo-1.png" alt="">
      <p>
        위 스크린샷은 그만두고 나오던 시점의 모두의셔틀 메인화면인데, 얼마 전 접속해보니 아무래도 디자인 퀄리티 컨트롤에 실패한 것 같다는 느낌이 들었다(...) 메인화면의 커버에는 제발 고해상도 이미지를 쓰도록 하자.<br/><br/>
      </p>
      <p>
        <a href="https://www.modooshuttle.com" target="_blank">모두의셔틀 Web</a>
      </p>
    </div>
  </div>
</template>

<script>
export default {

};

</script>

<style lang='scss' scoped>

</style>