<template>
  <div class="container-detail">
    <div class="title">
      Redot
      <div class="sub-title">
        Community Platform
      </div>
    </div>
    <div class="bar"></div>
    <div class="body">
      <h3>
        UX/UI Design
      </h3>
      <p>
        redot은 3세대 커뮤니티 플랫폼을 표방한다.
      </p>
      <p>
        많은 소셜 미디어와 컨텐츠 플랫폼등의 최근 추세는 관심기반 관련 컨텐츠를 알고리즘을 통해 추천해주는 것이다. 하지만 이러한 추세는 확증편향을 강화하고 폐쇄적 커뮤니티를 만드는 부작용도 함께 갖고 있는 것이 사실이다. 리닷에서는 이런 부분들을 역으로 매칭하여, 사람들이 다양한 의견들을 접하게 하고 더 많은 토론을 유발하도록 설계헸다. 그 속에 맥락 기반 광고 시스템을 고안하여 매력적인 컨텐츠에 매력적인 광고가 붙어 더욱 풍성한 컨텐츠가 될 수 있도록 기획하였다.
      </p>
      <h3>
        Business
      </h3>
      <p>
        비즈니스적으로 보았을 때 한국 온라인 커뮤니티들의 트래픽은 페이스북 코리아와 비교해 낮지 않은 수치를 보여준다. 반면 수익률은 10분의 1도 안되는데, 그 이유는 대부분의 한국 온라인 커뮤니티들은 제로보드나 그누보드 등의 게시판으로 구현되어 광고 매커니즘에 한계가 있을 수 밖에 없고, 운영 또한 기술적으로 커버할 수 없는 구조로 되어있어 규모가 커질수록 운영하는 데 있어 심각한 비효율이 발생하기 때문이다. redot은 이러한 구조적 한계를 극복하고 컨텐츠 생산자와 플랫폼이 수익을 공유할 수 있는 시스템을 만들고자 했다.
      </p>
      <p>하지만 개발 도중 투자금이 다 떨어지고, 추가적인 투자유치에 실패해 팀이 해산되었다. 하지만 언젠가는 다시 한번 시도해보고 싶은 아이템이다.</p>
      <img src="~/assets/images/redot-1.png" alt="">
    </div>
  </div>
</template>

<script>
export default {
  methods: {
  
  },
  components: {

  },
};

</script>

<style lang='scss' scoped>

</style>